# Необходимо написать программу,
# которая будет считывать со стандартного ввода имя пользователя
# и выводить приветствие вида “Hello, [Username]”.


# Считываем имя пользователя со стандартного ввода
username = input().strip()

# Формируем и выводим строку приветствия
print(f"Hello, {username}")